---
kind: property
id: P:Autodesk.Revit.DB.Events.DocumentSaveToCentralProgressChangedEventArgs.FailureDueToConflicts
source: html/04ee5916-3914-9d57-e9f1-d979db6fd681.htm
---
# Autodesk.Revit.DB.Events.DocumentSaveToCentralProgressChangedEventArgs.FailureDueToConflicts Property

Indicates the 'save to central' failure is caused by submission conflicts, that is because another one finished saving to central first.

## Syntax (C#)
```csharp
public bool FailureDueToConflicts { get; }
```